const news = [
  {
    id:'356412',
    title:'特写：2019，天安门城楼前的中国',
    poster:'http://image1.chinanews.com.cn/cnsupload/big/2019/10-01/4-426/a7e426b0dd6c43d2bc710fafe810a0d5.jpg',
    add_date:'2019-10-01',
    content:'\t对于普通民众而言，一场阅兵式，军事装备展示无疑最令人期待。这个昔日饱经炮火、战乱洗礼的民族，此刻正在集中向世界展示70年来国家的发展进步。\n习近平曾说，“我经常看中国近代的一些史料，一看到落后挨打的悲惨场景就痛彻肺腑！”谈及百余年前的甲午战争，他称之为“剜心之痛”。\n\t今天，中国自主研发的东风-41洲际战略核导弹、巨浪-2导弹等尖端武器揭开神秘面纱，在长安街上鱼贯而过，中外记者手中的相机，记录下中国军队的透明姿态。由轰-6N新型远程战略轰炸机领衔的160余架各型飞机编成的空中梯队剑舞苍穹，俯瞰它所守护的中华大地。\n\t70年前，在开国大典的阅兵式上，受阅的飞机仅有17架。飞机不够，要飞两遍。“70年，弹指一挥间。新时代的中国，早已是山河无恙、国富兵强，我们的飞机再也不用飞第二遍了。此时此刻，我们足以告慰先烈：这盛世，如您所愿。”这段源自网友的概括，构成70年间中国人的情感共鸣。\n\t数百年来，无论顺境还是逆境，中国人不输出问题，也没有通过强买强卖、掠夺别国发展自己，而是依靠“自己的担子自己扛”、在改革开放中同世界深度互动，实现了发展和繁荣。\n\t70年来，经济总量从新中国成立之初的600多亿元(人民币，下同)到2018年突破90万亿元，人均国内生产总值从119元增加到64644元，成为世界第二大经济体。连续多年，中国对世界经济增长的贡献率保持在30%左右。关乎民生福祉的各项指标也持续攀升。和平发展杠杆的两端，一头挑起国家的进益，一头担着民族的复兴。\n\t中国人珍视“以和为贵”的价值传承，自古倡导“强不执弱、富不侮贫”。过去70年，中国没有主动挑起任何一场战争和冲突，没有侵占过别国一寸土地。改革开放以来，中国主动裁减军队员额400余万，不断向世界传递“和”的理念与信号。在之前的多个国际场合中，习近平均强调“无论发展到哪一步，中国都永远不称霸、永远不搞扩张，永远不会把自身曾经经历过的悲惨遭遇强加给其他民族”。\n\t70年来，中国的国际形象早已超越熊猫、长城与功夫。作为一个负责任大国的形象日益饱满，这个国家提出的人类命运共同体理念写入了联合国决议，中国的发展快车，为他国带来兼顾舒适度与安全性的席位，亦为各方争取和提供更多共赢平台。\n\t如今，在北京城古老的建筑身旁，“人类命运共同体”彩车现身长安街，传递出中国与世界“天下大同”“有容乃大”的共存格局。中国人始终坚信，推动构建人类命运共同体，不是倡导每个国家必须遵循统一的价值标准，更不是一种制度替代另一种制度，而是主张不同社会制度、不同意识形态、不同历史文明、不同发展水平的国家，在国际活动中目标一致、利益共生。'
  },
  {
    id:'546734',
    title:'中国成功发射高分十号卫星 主要用于国土普查、防灾减灾等领域',
    poster:'http://i2.chinanews.com/simg/cmshd/2019/10/05/998e12aa71f248d4a797761b18e48418.jpg',
    date:'2019-10-05',
    content:'中新网北京10月5日电(郭超凯 赵金龙)北京时间10月5日2时51分，中国在太原卫星发射中心用长征四号丙运载火箭，成功将高分十号卫星发射升空，卫星顺利进入预定轨道，任务获得圆满成功。\n高分十号卫星是高分辨率对地观测系统国家科技重大专项安排的微波遥感卫星，地面像元分辨率最高可达亚米级，主要用于国土普查、城市规划、土地确权、路网设计、农作物估产和防灾减灾等领域，可为“一带一路”等国家重大战略实施和国防现代化建设提供信息保障。\n长征四号丙运载火箭和高分十号卫星，均由中国航天科技集团有限公司所属上海航天技术研究院研制。此次任务是长征系列运载火箭的第314次航天飞行。(完)'
  },
  {
    id:'239875',
    title:'记者手记：国家庆典，每个人都是记录者',
    poster:'http://i2.chinanews.com/simg/cmshd/2019/10/01/c5391220f28d49bdbd14c58a4300bde0.jpg',
    add_date:'2019-10-01',
    content:'10月1日凌晨3时，大批中外记者先后乘坐巴士，向天安门方向出发。\n仍处于夜幕中的北京，多数市民正在享受难得的假期时光。此刻长安街上的安静，将与7个小时后形成巨大反差。\n作为今年中国官方举行的重要活动——新中国成立70周年庆典，吸引了4700余名中外记者报名采访。被外界誉为“站在世界版图前的中国”，70年后发展坐标定向何方，本身自带足够吸引力。\n巴士内的媒体人，有的抓紧时间休息，亦有人拿起手机或相机，隔着车窗记录下历史瞬间。'
  }
]

//获取新闻列表
function getNewsList(){
  let list = [];
  for(var i = 0; i < news.length; ++i){
    let obj = {};
    obj.id = news[i].id;
    obj.title = news[i].title;
    obj.poster = news[i].poster;
    obj.add_date = news[i].add_date;
    obj.content = news[i].content;
    list.push(obj);
  }
  return list;
}

//获取新闻内容
function getNewsDetail(newsID){
  let message = {
    code:'404',
    news:{}
  };
  for(var i = 0; i < news.length; ++i){
    if(newsID == news[i].id){
      message.code = '200',
      message.news =  news[i];
      break;
    }
  }
  return message;
}

//暴露接口，便于外部文件调用
module.exports = {
  getNewsList:getNewsList,
  getNewsDetail:getNewsDetail
}